# 13: Konversi nilai numerik ke dalam sejumlah kategori

# Import Modules

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [6]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    75
1    46
2    58
3    83
4    66
5    84
6    58
7    65
8    37
9    76

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [9]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    75        manula
1    46        dewasa
2    58        dewasa
3    83        manula
4    66        manula
5    84        manula
6    58        dewasa
7    65        dewasa
8    37        dewasa
9    76        manula